package comment;

public class Comment {

	public static void main(String[] args) {
		/*
		 * 주석 (Comment)
		 * - 비실행문으로, 자바 프로그램 컴파일(번역) 대상에서 제외되는 문장
		 * - 주 용도 : 프로그램 코드에 대한 설명문 등을 작성
		 * 
		 * 1. 라인 주석 = 단일 주석 = 한 줄 주석 => // 기호 사용
		 * 		- // 기호 뒤의 문장 한 줄을 주석으로 처리
		 * 		- 주석 설정 단축키 : 주석 처리할 문장에 커서를 위치한 후
		 * 							Ctrl + Shift + C 또는 Ctrl + /
		 * 		- 주석 해제 단축키도 설정과 동일함
		 * 		- 여러 줄 주석 처리에도 활용 가능 (여러 줄 블럭 지정 후 주석처리)
		 * 
		 * 2. 범위 주석 = 블록 주석 /*  */
		 /* 	- 주석 기호 사이에 오는 모든 문장들은 주석처리
		  * 	- 여러 줄에 걸쳐서 모든 범위를 지정할 수도 있다.
		  * 	- 주석 설정 단축키 : 주석 처리할 블록을 정확히 지정한 후
		  * 						Ctrl + Shift + /
		  * 						=> 문장 위치가 자동 조절되므로 단축키 사용 비추천
		  * 	- 주석 해제 단축키 : 주석 처리할 블록을 정확히 지정한 후
		  * 						Ctrl + Shift + \	
		  * 
		  * */

	}

}
